Tekla Open API Reference for Tekla Structures 2025
AnalysisLocalCoordinateSystem Class
 The AnalysisLocalCoordinateSystem class contains local coordinate system information for an analysis model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisLocalCoordinateSystem
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AnalysisLocalCoordinateSystem
Public Class AnalysisLocalCoordinateSystem
The AnalysisLocalCoordinateSystem type exposes the following members.
Constructors
Name | Description
AnalysisLocalCoordinateSystem
 Creates a new analysis local coordinate system instance.
Top
Properties
Name | Description
LocalX
 The local X direction.
LocalY
 The local Y direction.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace